Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_QSPI_TLE9180D_2/Libraries/Infra/Sfr/TC38x/IfxMtu_bf.h
/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU3_PMEM_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PMEM_DONE_OFF (17u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU3_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PTAG_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU3_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PTAG_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU3_PTAG_DONE */
#define IFX_MTU_MEMDONE0_CPU3_PTAG_DONE_OFF (18u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.CPU3_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DLMU_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.CPU3_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DLMU_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.CPU3_DLMU_DONE */
#define IFX_MTU_MEMDONE0_CPU3_DLMU_DONE_OFF (19u)

/** \brief Length for Ifx_MTU_MEMDONE0_Bits.LMU00_DONE */
#define IFX_MTU_MEMDONE0_LMU00_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE0_Bits.LMU00_DONE */
#define IFX_MTU_MEMDONE0_LMU00_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE0_Bits.LMU00_DONE */
#define IFX_MTU_MEMDONE0_LMU00_DONE_OFF (30u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.CPU0_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU0_DMEM1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.CPU0_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU0_DMEM1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.CPU0_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU0_DMEM1_DONE_OFF (2u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.CPU1_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU1_DMEM1_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.CPU1_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU1_DMEM1_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.CPU1_DMEM1_DONE */
#define IFX_MTU_MEMDONE1_CPU1_DMEM1_DONE_OFF (3u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.DAM0_DONE */
#define IFX_MTU_MEMDONE1_DAM0_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.DAM0_DONE */
#define IFX_MTU_MEMDONE1_DAM0_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.DAM0_DONE */
#define IFX_MTU_MEMDONE1_DAM0_DONE_OFF (6u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.SADMA_DONE */
#define IFX_MTU_MEMDONE1_SADMA_DONE_OFF (9u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.MINI_MCDS_DONE */
#define IFX_MTU_MEMDONE1_MINI_MCDS_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.MINI_MCDS_DONE */
#define IFX_MTU_MEMDONE1_MINI_MCDS_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.MINI_MCDS_DONE */
#define IFX_MTU_MEMDONE1_MINI_MCDS_DONE_OFF (10u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_FIFO_DONE */
#define IFX_MTU_MEMDONE1_GTM_FIFO_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_FIFO_DONE */
#define IFX_MTU_MEMDONE1_GTM_FIFO_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_FIFO_DONE */
#define IFX_MTU_MEMDONE1_GTM_FIFO_DONE_OFF (21u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0SLOW_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0SLOW_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0SLOW_DONE_OFF (22u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0FAST_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0FAST_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_MCS0FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS0FAST_DONE_OFF (23u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1SLOW_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1SLOW_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1SLOW_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1SLOW_DONE_OFF (24u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1FAST_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1FAST_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_MCS1FAST_DONE */
#define IFX_MTU_MEMDONE1_GTM_MCS1FAST_DONE_OFF (25u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1A_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1A_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1A_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1A_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1A_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1A_DONE_OFF (26u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1BC_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1BC_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1BC_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1BC_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL1BC_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL1BC_DONE_OFF (27u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL2_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL2_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL2_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL2_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.GTM_DPLL2_DONE */
#define IFX_MTU_MEMDONE1_GTM_DPLL2_DONE_OFF (28u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.MCAN10_DONE */
#define IFX_MTU_MEMDONE1_MCAN10_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.MCAN10_DONE */
#define IFX_MTU_MEMDONE1_MCAN10_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.MCAN10_DONE */
#define IFX_MTU_MEMDONE1_MCAN10_DONE_OFF (30u)

/** \brief Length for Ifx_MTU_MEMDONE1_Bits.MCAN20_DONE */
#define IFX_MTU_MEMDONE1_MCAN20_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE1_Bits.MCAN20_DONE */
#define IFX_MTU_MEMDONE1_MCAN20_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE1_Bits.MCAN20_DONE */
#define IFX_MTU_MEMDONE1_MCAN20_DONE_OFF (31u)

/** \brief Length for Ifx_MTU_MEMDONE2_Bits.MCAN21_DONE */
#define IFX_MTU_MEMDONE2_MCAN21_DONE_LEN (1u)

/** \brief Mask for Ifx_MTU_MEMDONE2_Bits.MCAN21_DONE */
#define IFX_MTU_MEMDONE2_MCAN21_DONE_MSK (0x1u)

/** \brief Offset for Ifx_MTU_MEMDONE2_Bits.MCAN21_DONE */
#define IFX_MTU_MEMDONE2_MCAN21_DONE_OFF (0u)

